Catalogs/ПЛ_События.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_События</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ИсточникиСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистратор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРегламентнойПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ПериодичностьРегламентныхПроверок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодписки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_ИсточникиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ИсточникиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаписьДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникРегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнаяПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_События/Forms/ВыборРегистратора/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсточникСобытия = Параметры.ИсточникСобытия;
	
	Если ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
		Или ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента Тогда
		ВетвьМетаданных = Метаданные.Документы;
		ЭтаФорма.Заголовок = "Выбор документа";
	ИначеЕсли ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
		ВетвьМетаданных = Метаданные.Справочники;
		ЭтаФорма.Заголовок = "Выбор справочника";
	ИначеЕсли ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
		ВетвьМетаданных = Метаданные.РегистрыСведений;
		ЭтаФорма.Заголовок = "Выбор сведений";
	КонецЕсли;
	Элементы.СписокОбъектовЗначение.Заголовок = Параметры.ИсточникСобытия;
	
	// Заполнение списка регистраторов
	Для каждого Метаданное Из ВетвьМетаданных Цикл
		НоваяСтрока = СписокОбъектов.Добавить(Метаданное.Имя, Метаданное.Представление());
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.Регистратор) Тогда
		Регистратор = СписокОбъектов.НайтиПоЗначению(Параметры.Регистратор);
		Если Регистратор <> Неопределено Тогда
			Элементы.СписокОбъектов.ТекущаяСтрока = СписокОбъектов.Индекс(Регистратор);
		КонецЕсли;
	КонецЕсли;
	
	СписокОбъектов.Добавить("---");
	СписокОбъектов.СортироватьПоПредставлению();
	
	// Вынесение в начало списка наиболее важных регистраторов
	СписокВажныхРегистраторов = СписокВажныхРегистраторов(ИсточникСобытия);
	
	Если СписокВажныхРегистраторов <> Неопределено Тогда
		СписокВажныхРегистраторов.Добавить("---");
		СортироватьСписокОбъектов(СписокВажныхРегистраторов);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СписокОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОсуществитьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОсуществитьВыбор();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция СписокВажныхРегистраторов(ТипИсточника)
	
	СписокВажныхРегистраторов = Новый Массив;
	
	ВерсияПодсистемыУТ = ПЛ_УведомленияОСобытиях.ВерсияУТ();
	
	Назначение = "";
	Если ВерсияПодсистемыУТ = "10" Тогда
		Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
			Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента Тогда
			Назначение = "Документы_УПП";
		ИначеЕсли ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			Назначение = "Справочники_УПП";
		ИначеЕсли ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
			Назначение = "Сведения_УПП";
		КонецЕсли;
	ИначеЕсли ВерсияПодсистемыУТ = "11" Тогда
		Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
			Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента Тогда
			Назначение = "Документы_УП";
		ИначеЕсли ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			Назначение = "Справочники_УП";
		ИначеЕсли ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
			Назначение = "Сведения_УП";
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(Назначение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВажныеРегистраторыXML = Справочники.ПЛ_События.ПолучитьМакет("ВажныеРегистраторыСобытий").ПолучитьТекст();
	
	ЧтениеXML  = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ВажныеРегистраторыXML);
	ВажныеРегистраторы = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Если ВажныеРегистраторы <> Неопределено Тогда
		СписокВажныхРегистраторов = ВажныеРегистраторы[Назначение];
	КонецЕсли;
	
	Возврат СписокВажныхРегистраторов;
	
КонецФункции

&НаСервере
Процедура СортироватьСписокОбъектов(СписокВажныхРегистраторов)
	
	КоличествоВажныхРегистраторов = СписокВажныхРегистраторов.Количество();
	Для инд = 1 По КоличествоВажныхРегистраторов Цикл
		ВажныйРегистратор = СписокОбъектов.НайтиПоЗначению(СокрЛП(СписокВажныхРегистраторов[КоличествоВажныхРегистраторов-инд]));
		Если ВажныйРегистратор <> Неопределено Тогда
			СписокОбъектов.Сдвинуть(ВажныйРегистратор, - СписокОбъектов.Индекс(ВажныйРегистратор));
		КонецЕсли;
	КонецЦикла;
	// Разделитель
	Разделитель = СписокОбъектов.НайтиПоЗначению("---");
	Если СписокОбъектов.Индекс(Разделитель) = 0 Тогда
		СписокОбъектов.Удалить(Разделитель);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОсуществитьВыбор()
	
	ТекущиеДанные = Элементы.СписокОбъектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		ИЛИ ТекущиеДанные.Значение = "---" Тогда
		Возврат;
	Иначе
		ОповеститьОВыборе(ТекущиеДанные);
		Если (МодальныйРежим ИЛИ ЗакрыватьПриВыборе) И Открыта() Тогда
			Закрыть(ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
